{
  "entries": [
    {
      "type": "rts",
      "content": "The bank's diversified business model delivered resilient performance this quarter, with particular strength in Wealth Management and Canadian Personal Banking. Record AUM levels and robust mortgage volumes more than offset headwinds in Capital Markets trading activity. The credit environment remains manageable with PCL ratio within guided range and strong allowance coverage providing downside protection."
    },
    {
      "type": "transcript",
      "content": "We are managing through this credit normalization cycle from a position of strength, with robust capital levels and conservative underwriting standards.",
      "speaker": "John Smith",
      "title": "CEO"
    },
    {
      "type": "rts",
      "content": "Digital adoption across retail channels reached 73% this quarter, up from 68% a year ago. Management highlighted that automation of routine transactions is enabling branch staff to focus on higher-value advisory conversations, contributing to improved client satisfaction scores. Investment in AI-powered fraud detection has reduced losses by 22% YoY while enhancing customer experience through faster transaction approvals."
    },
    {
      "type": "transcript",
      "content": "We remain confident in achieving positive operating leverage by year-end as expense growth moderates and revenue momentum builds across our fee-based businesses.",
      "speaker": "Sarah Johnson",
      "title": "CFO"
    },
    {
      "type": "rts",
      "content": "Credit quality metrics remained stable with gross impaired loans flat quarter-over-quarter. The allowance coverage ratio increased to 158%, reflecting management's proactive approach to reserving against potential deterioration in the commercial real estate and unsecured consumer portfolios. Stage 3 formations were elevated but within expectations, with recoveries improving sequentially as workout teams accelerate resolution timelines."
    },
    {
      "type": "transcript",
      "content": "Our technology investments are paying dividends—we've reduced time-to-yes on commercial loans by 40% while maintaining underwriting discipline. This is translating directly into market share gains in our core mid-market segment.",
      "speaker": "Michael Chen",
      "title": "Head of Commercial Banking"
    }
  ]
}
